Ran Plan for dir: `.` workspace: `area13`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # digitalocean_droplet.forem has changed
~ resource "digitalocean_droplet" "forem" {
        id                   = "255862486"
      ~ name                 = "www.evilfactorylabs.org" -> "evilfactorylabs.org"
        tags                 = []
        # (21 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_domain.evilfactorylabs_social will be created
+ resource "digitalocean_domain" "evilfactorylabs_social" {
      + id   = (known after apply)
      + name = "evilfactorylabs.social"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # digitalocean_droplet.evilfactorylabs_social must be replaced
-/+ resource "digitalocean_droplet" "evilfactorylabs_social" {
      ~ created_at           = "2023-06-29T11:34:48Z" -> (known after apply)
      ~ disk                 = 50 -> (known after apply)
      + graceful_shutdown    = false
      ~ id                   = "362825530" -> (known after apply)
      ~ image                = "ubuntu-22-04-x64" -> "362825530" # forces replacement
      ~ ipv4_address         = "178.128.103.137" -> (known after apply)
      ~ ipv4_address_private = "10.104.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "evilfactorylabs.social"
      ~ price_hourly         = 0.03571 -> (known after apply)
      ~ price_monthly        = 24 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:362825530" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "8e9d1d94-ca3d-4b0a-a489-f0ffec8e3a2b" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # digitalocean_droplet.forem will be updated in-place
~ resource "digitalocean_droplet" "forem" {
      + graceful_shutdown    = false
        id                   = "255862486"
      ~ name                 = "evilfactorylabs.org" -> "www.evilfactorylabs.org"
        tags                 = []
        # (21 unchanged attributes hidden)
    }

  # digitalocean_firewall.forem will be updated in-place
~ resource "digitalocean_firewall" "forem" {
        id              = "cdaa6351-3e24-481d-984a-d58383c13f2a"
        name            = "www.evilfactorylabs.org"
        tags            = []
        # (4 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "25565" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }

      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "tcp" -> null
        }
      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "udp" -> null
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }

        # (5 unchanged blocks hidden)
    }

  # digitalocean_record.evilfactorylabs_social_apex will be created
+ resource "digitalocean_record" "evilfactorylabs_social_apex" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # digitalocean_record.evilfactorylabs_social_cdn will be created
+ resource "digitalocean_record" "evilfactorylabs_social_cdn" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "cdn"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "evilfactorylabs-social-sgp1-digitaloceanspaces.b-cdn.net."
    }

  # digitalocean_record.evilfactorylabs_social_mailgun will be created
+ resource "digitalocean_record" "evilfactorylabs_social_mailgun" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "email.mg"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = "eu.mailgun.org."
    }

  # digitalocean_record.evilfactorylabs_social_mailgun_dkim will be created
+ resource "digitalocean_record" "evilfactorylabs_social_mailgun_dkim" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "mta._domainkey.mg"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCrPKiwLlHzORW+15yUzFqA3qaVqs8oCmz69hNOaEx5sAnxpP7GpVvapEB/Bt2LNb1memDHcNfwwc7aUYI7YYUAQtPB8Tmfy1p91skVIdeNpJ3TM8qemKmZ3JIeO/JztzOIwwUjUY8dg7OuoP9zJAK/JU6lcbpdDBHUpSVEYqBsKQIDAQAB"
    }

  # digitalocean_record.evilfactorylabs_social_mailgun_mx["0"] will be created
+ resource "digitalocean_record" "evilfactorylabs_social_mailgun_mx" {
      + domain   = (known after apply)
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 10
      + ttl      = (known after apply)
      + type     = "MX"
      + value    = "mxa.eu.mailgun.org."
    }

  # digitalocean_record.evilfactorylabs_social_mailgun_mx["1"] will be created
+ resource "digitalocean_record" "evilfactorylabs_social_mailgun_mx" {
      + domain   = (known after apply)
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 10
      + ttl      = (known after apply)
      + type     = "MX"
      + value    = "mxb.eu.mailgun.org."
    }

  # digitalocean_record.evilfactorylabs_social_mailgun_spf will be created
+ resource "digitalocean_record" "evilfactorylabs_social_mailgun_spf" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "mg"
      + ttl    = (known after apply)
      + type   = "TXT"
      + value  = "v=spf1 include:mailgun.org ~all"
    }

  # digitalocean_record.evilfactorylabs_social_u will be created
+ resource "digitalocean_record" "evilfactorylabs_social_u" {
      + domain = (known after apply)
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "u"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

Plan: 10 to add, 2 to change, 1 to destroy.

Changes to Outputs:
+ evilfactorylabs_social_ip      = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "linode_token" but a
│ value was found in file "/etc/atlantis/area13.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w area13`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.evilfactorylabs.org/lock?id=evilfactorylabs%252Farea13%252F.%252Farea13)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w area13`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 10 to add, 2 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
